app/views/user_books/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.select :user_id, User.order(:username).map { |user| [user.username, user.id] }, include_blank: true %>
---
SELECT "users".* FROM "users" ORDER BY "users"."username" ASC

    <%= form.label :book_id, style: "display: block" %>
    <%= form.select :book_id, Book.order(:title).map { |book| [book.title, book.id] }, include_blank: true %>
---
SELECT "books".* FROM "books" ORDER BY "books"."title" ASC