app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ('The Great Gatsby', '2026-01-30 02:12:26.963535', '2026-01-30 02:12:26.963535', 'Fitzy', 0.01, '2026-01-30') RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = 'The Great Gatsby II', "updated_at" = '2026-01-26 17:24:04.777449' WHERE "books"."id" = 1

  def destroy
    @book.destroy!
---
DELETE FROM "books" WHERE "books"."id" = 2

    def set_book
      @book = Book.find(params.expect(:id))
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1